import math


def area(r):
    '''
    Вычисляет площадь круга по формуле S = pi * r**2

    Параметры:
        r (int): радиус круга

    Возвращает:
        float: площадь круга

    Пример вызова:
        area(2)
        12.566370614359172
    '''
    return math.pi * r * r


def perimeter(r):
    '''
    Вычисляет периметр круга по формуле P = 2 * pi * r

    Параметры:
        r (int): радиус круга.

    Возвращает:
        float: длина окружности

    Пример вызова:
        perimeter(1)
        6.283185307179586
    '''
    return 2 * math.pi * r