def area(a):
    '''
    Вычисляет площадь квадрата по формуле S = a**2

    Параметры:
        a (int): длина стороны квадрата

    Возвращает:
        int: площадь квадрата

    Пример вызова:
        area(5)
        25
    '''
    return a * a


def perimeter(a):
    '''
    Вычисляет периметр квадрата по формуле P = 4 * a

    Параметры:
        a (int): длина стороны квадрата

    Возвращает:
        int: периметр квадрата

    Пример вызова:
        perimeter(5)
        20
    '''
    return 4 * a