def area(a, h):
    '''
    Вычисляет площадь треугольника по формуле S = a * h / 2

    Параметры:
        a (int): длина основания треугольника
        h (int): высота, опущенная на это основание

    Возвращает:
        float: площадь треугольника.

    Пример вызова:
        area(6, 4)
        12.0
    '''
    return a * h / 2


def perimeter(a, b, c):
    '''
    Вычисляет периметр треугольника по формуле P = a + b + c

    Параметры:
        a (int): длина 1-й стороны
        b (int): длина 2-й стороны
        c (int): длина 3-й стороны

    Возвращает:
        int: периметр треугольника

    Пример вызова:
        perimeter(3, 4, 5)
        12
    '''
    return a + b + c